{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\uae30\uc068",
    "1": "\ub180\ub77c\uc6c0",
    "2": "\ub450\ub824\uc6c0",
    "3": "\ubd84\ub178",
    "4": "\ubd88\ucf8c\ud568",
    "5": "\uc124\ub818",
    "6": "\uc2ac\ud514",
    "7": "\ud3c9\ubc94\ud568"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "\uae30\uc068": 0,
    "\ub180\ub77c\uc6c0": 1,
    "\ub450\ub824\uc6c0": 2,
    "\ubd84\ub178": 3,
    "\ubd88\ucf8c\ud568": 4,
    "\uc124\ub818": 5,
    "\uc2ac\ud514": 6,
    "\ud3c9\ubc94\ud568": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
